Repository: mozilla-l10n/mt-training-data
Catalog: pai/pai_pontoon.tmx
Source language: en_us
Languages: pai

source: Allow autoplay
pai: Yemik chuboowu mnmak

source: App updates
pai: Aplicación baam chmiich

source: Block autoplay
pai: Yemik chubowuha mtket

source: &brandShortName; Push notifications
pai: &brandShortName; Push chknaabch

source: Browser
pai: Sal amchu

source: Customize &brandShortName; with add-ons. Block ads, add features, or choose a new theme to reflect your personality.
pai: Chwiham mtyeeb mwiiy majanu. Chapyt kjabha tket, chapyt t´t orrum chwichyiib sal ukjaab o chapyt jkaay myok maa chmwiwu chuwuha ŕpoobhikyawa.

source: Downloads
pai: Unalch

source: Firefox has experienced a network protocol violation that cannot be repaired.
pai: Firefox chapayt klyeeb wichyom kur uuk red hal yom yus kos chajaan yutem.

source: Media playback
pai: Multimedi chubowu

source: Network Protocol Error
pai: Protocol redhal ch`chaamch

source: Pause
pai: Mchuŕkwis

source: Pause playing
pai: Booha mchuŕkwis

source: Play
pai: Chubowu

source: <p><span class='hostname'></span> uses security technology that is outdated and vulnerable to attack. An attacker could easily reveal information which you thought to be safe. The website administrator will need to fix the server first before you can visit the site.</p><p>Error code: NS_ERROR_NET_INADEQUATE_SECURITY</p>
pai: <p><span class='hostname'></span> Tecnologiiy jankrabham mtrchech paa jwayaach kyaaw kos trchechñtem ñwak kos jantñtemum. Paa jwakyahay chapayt byaw ik knaabyuk maay ñubyukabyuu mik wañmŕibm. Amchu ha paa ktrcheech hay chapayt k`klyeba chajana may kos amchuha mbaam temtka.</p><p>Codig ch`chaamch: NS_ERROR_NET_INADEQUATE_SECURITY</p>

source: <p>The page you are trying to view cannot be shown because an error in the network protocol was detected.</p><ul><li>Please contact the website owners to inform them of this problem.</li></ul>
pai: <p>Tñur ŕmeechu m`uhi munuuhay , kos uuch yutem protocool redhal ch`chamch sal yom uuch.</p><ul> <li>Kamwih mumuu.Amchu web kñkwiiyham mknaaw chapayt k`klyeebha paa mukunabhikyawa.</li></ul>

source: <p>The requested document is not available in &brandShortName;’s cache.</p><ul><li>As a security precaution, &brandShortName; does not automatically re-request sensitive documents.</li><li>Click Try Again to re-request the document from the website.</li></ul>
pai: <p>Tñur k´kaach hah kos caché &brandShortName; wihal yaktem.</p><ul><li>Mŕboh majanuka, &brandShortName; hay kos tñur mŕaayha kos k´kaabtem.</li><li>Mtkweek tñur webhal kyakha mŕmeeyik clic mwika.</li></ul>

source: <p><ul><li>Please contact the website owners to inform them of this problem.</li></ul></p>
pai: <p><ul><li>Kamwih mumuu amchu web kñkwiiyham mknaaw chapayt k`klyeebha paa mukunabhikyawa.</li></ul></p>

source: Resume playing
pai: Chubowu mnamaan

source: Share via
pai: Yam maat m'eem

source: Site notifications
pai: Amchu chknaabch

source: Sound and video
pai: Videey tpalu

source: Synced tabs
pai: Ch chkwachu payt blwiy

source: (To enable this option, &pref_feature_tips_notification_enabling_path; must already be enabled.)
pai: (Trchechu yam mchubowuhik kyawa, &pref_feature_tips_notification_enabling_path; yay kur chubowukwa yaŕaal.)

source: Turn on
pai: Chubowu

source: <ul> <li>Check the address for typing errors such as <strong>ww</strong>.example.com instead of <strong>www</strong>.example.com</li> <div id='searchbox'> <input id='searchtext' type='search'></input> <button id='searchbutton'>Search</button> </div> <li>If you are unable to load any pages, check your device’s data or Wi-Fi connection. <button id='wifi'>Enable Wi-Fi</button> </li> </ul>
pai: <ul> <li>Mtñur ch´chamchu tñur kwimchuhal yok yabyuka: <strong>ww</strong>.example.com yabyutemka <strong>www</strong>.example.com</li> <div id='searchbox'> <input id='searchtext' type='search'></input> <button id='searchbutton'>Ŕmee</button> </div> <li>Kos tñur uchú mjukewkyaw myutem myus, tublich chi Wi-Fi dispositiiv chpach chu mwiha. <button id='wifi'>Wi-Fi mchubowu</button> </li> </ul>

source: <ul> <li>The site could be temporarily unavailable or too busy. Try again in a few moments.</li> <li>If you are unable to load any pages, check your mobile device’s data or Wi-Fi connection. <button id='wifi'>Enable Wi-Fi</button> </li> </ul>
pai: <ul> <li>Amchu yay kos soltem kwa o trchech tewulim wiiy. Mtkweek mwiyik.</li> <li>Kos tñur uchú mjukewkyaw myutem myus, tublich chi Wi-Fi dispositiiv chpach chu mwiha. <button id='wifi'>Wi-Fi mchubowu</button> </li> </ul>

source: <ul> <li>This could be a problem with the server’s configuration, or it could be someone trying to impersonate the server.</li> <li>If you have connected to this server successfully in the past, the error may be temporary, and you can try again later.</li> </ul>
pai: <ul> <li>Ya chklyeeb chajanchuhak chpachmaat o ñipemum ñika´aay saa wulik sal kjkee k´am.</li> <li>Kur chpach chu paa kubtar yal mchpaachumyuuch myus, ñubyukus ch´chamch yak yoyay wayiib kjkee, pay mtkeek mwiyik</li> </ul>

source: <ul> <li>Web addresses are usually written like <strong>http://www.example.com/</strong></li> <div id='searchbox'> <input id='searchtext' type='search'></input> <button id='searchbutton'>Search</button> </div> <li>Make sure that you’re using forward slashes (i.e. <strong>/</strong>).</li> </ul>
pai: <ul> <li>Tñur kwimchu amchuhay pichtem yabyuyik <strong>http://www.example.com/</strong></li> <div id='searchbox'> <input id='searchtext' type='search'></input> <button id='searchbutton'>Ŕmee</button> </div> <li>M´uh majanuka trchech chu oblicuas ham mtrechyha (Yabyuka: <strong>/</strong>).</li> </ul>

source: Use your microphone to search or enter address
pai: Microfnha myo ñum mtrchech tñut kwimchuhal mjab´ikyawa

source: Use your QR Reader to search or enter address
pai: Ch´uchu QR m chŕmee o tñur kwimchu hal jab´ikyawa

source: &vendorShortName; Location Service
pai: &vendorShortName; Paa ŕmeechu kbtaar

source: &vendorShortName; Location Service running
pai: &vendorShortName; Wachu chjanch hay boo kwa

source: &vendorShortName; tips and tricks
pai: &vendorShortName; paa kwaaw eech ee ñum reebch

source: alert
pai: ipeekjanchu

source: Always
pai: T t'or

source: animation
pai: kwaa paa eech

source: Cancel
pai: Ŕput

source: caption
pai: chkyuuk

source: check button
pai: casiill yooch

source: Check for updates
pai: Yak chmich ŕmee »

source: close
pai: ŕ´amch

source: Close
pai: Ŕ´amch

source: &Close
pai: &Ŕ´amch

source: Close (%S)
pai: Ŕ´ap (%S)

source: Close %S
pai: Ŕ´ap %S

source: column header
pai: tñuur chaabkyaak

source: combo box
pai: caaj deplegaabl

source: complementary
pai: complementari

source: content info
pai: nukwee wiyuha knaabch

source: date
pai: ñaam

source: definition
pai: kwaaw knaabch

source: definition list
pai: kwaach tñuur ŕit

source: Delete
pai: Ujiñ

source: Delete…
pai: Ujiñ…

source: dialog
pai: knaawch

source: Dismiss
pai: Nmak

source: document
pai: tñuur

source: e-mail
pai: correey electronik

source: entry
pai: jabchu

source: equation
pai: ecuacion

source: Error
pai: Chaam

source: figure
pai: maat

source: Firefox and the Firefox logos are trademarks of the Mozilla Foundation.
pai: Firefox e logotip firefox wiha paytum fundacion Mozilha wihan

source: Firefox Start, a fast home page with built-in search
pai: firefox Start pagin namanch chŕmeewultyeb

source: footer
pai: pagin kwaayk kyaak

source: grip
pai: kwisu

source: header
pai: chaab kyaak

source: heading
pai: tñuur chaabkyak

source: Home Page Selection
pai: pagin namaanch yooch

source: Import your home page from %S
pai: Pagin namaanch ujiiñ %S

source: &Learn more
pai: &Terabum ŕpo

source: Learn more
pai: Terabum ŕpo

source: Learn more…
pai: Terabum ŕpo…

source: Learn More
pai: Terabum Ŕpo

source: Learn More…
pai: Terabum Ŕpo…

source: main
pai: kajanha

source: Manage
pai: ŕboo

source: menu bar
pai: baar chŕmechu

source: menu popup
pai: menu wayibchu

source: Mozilla
pai: Mozil

source: Mozilla Firefox
pai: Mozil Firefox

source: navigation
pai: saal japaach

source: pane
pai: panel

source: paragraph
pai: tñurch

source: Please select the home page you wish to use:
pai: pagin namaanch ñumtrchechu\u0020

source: progress bar
pai: baar myaab yamch

source: radio button
pai: boton raadi

source: row
pai: fiil

source: row header
pai: fiil chabkyak

source: Screen reader started
pai: pantay namanch

source: Screen reader stopped
pai: pantaay bŕkwim uchu

source: scroll bar
pai: baarr kyuch´chu

source: search
pai: ŕmeech

source: Search
pai: Ŕmee

source: section
pai: waachŕit

source: separator
pai: chapayt ujinchu

source: slider
pai: jiboomchu

source: spin button
pai: boton chaterabchu

source: status bar
pai: baarr estaad

source: Sync
pai: Sinc

source: table
pai: taabl

source: telephone
pai: telefn

source: term
pai: samb´ob

source: text area
pai: sak tñurch

source: toggle button
pai: boton chu ujinchu

source: toolbar
pai: baarr chapaayt chajanchu

source: tree table
pai: taabl chapaayt knaabchu ( Mas o menos)

source: %1$d out of %2$d
pai: %1$d ya wi %2$d

source: %1$s also uses blocklists provided by Disconnect, Inc. as separate and independent works under the <a href="%2$s">GNU General Public License v3</a>, and available <a href="%3$s">here</a>.
pai: %1$s hay list ŕ´amchu ha kwiyik ya Disconect, Inc. kwii trchech buuk yak o yemik wii yak ntpachka <a href="%2$s">GNU ch´chyaabchu paa katee payt v3</a>, yal yaki <a href="%3$s">yakya</a>.

source: %1$s finished
pai: %1$s byir

source: %1$s is free and open source software made by Mozilla and other contributors.
pai: %1$s software kos codig wiiytem solkyoha Mozilla ha ee jkay kubtar cyobchya.

source: %1$s is made available to you under the terms of the <a href="%2$s">Mozilla Public License</a> and other open source licenses.
pai: %1$s hay ch`chyaach yakyakyam ich um yak <a href="%2$s">Mozilla ch`chyabch paa paytum wichum nyaamch</a> ñwak jkay solrab kyom sam nyamik.

source: %1$s will send what you type in the address bar to your search engine
pai: %1$s ey ñukwee ñumtñurum bar chŕmechuhal kwiima

source: About
pai: Sak ntpach

source: About %1$s
pai: %1$s kabyuwuh

source: About %1$s, help
pai: %1$s chŕmechum, nyamch

source: Add
pai: Sal chmii

source: Add and manage custom autocomplete URLs.
pai: URLs yemi wiha ñumchublwiha ŕmee sal chmii.

source: + Add another search engine
pai: + Motor jkaay chŕmeech kyaaw jkaay sal chmii

source: + Add custom URL
pai: + URL yeemik wii jam sal chmii

source: Add custom URL
pai: URL yeemik wii jam sal chmii

source: Additional source code for %1$s is available under various other free and open source <a href="%2$s">licenses</a>.
pai: Tñurcu jkaay codig %1$s wihay <a href="%2$s">t´t´orrum nyaam wak ñwak ch´chyaabchu</a>kos codig solum wiytem.

source: Add link to autocomplete
pai: Jabchu yemik matchublwiibu

source: Add search engine
pai: Chŕmeechu sal chmii

source: Add shortcuts to your home screen
pai: Pantaal kajanha wayiibraw sal mchmii

source: Add to Home screen
pai: Jabchu namaan ch hal mchmi

source: Advanced
pai: Jiboom

source: An installed search engine is already using that name.
pai: Motor chŕmechu kur sal chmiichum sal yak muul ñu mul.

source: As a private browser, we never save and cannot restore this tab.
pai: Ñul amchu kŕ´apchuwukyawa kos chapayt chwatem, sakyaaw kos tkweek chajaantem.

source: As a private browser, we never save and cannot restore your last browsing session.
pai: Ñul amchu kŕ´apchukyaawa kos chapayt kjkeech ñikakwaach sal amchu ha chkwaatem, ñwak kos chajantemi.

source: Authentication required
pai: Paychakjanuk ich piich

source: Autocomplete
pai: Yeemik chublwi

source: Autocomplete URLs for sites you use most Long-press any URL in the address bar
pai: Yemik URLs ñumtrchechrabha chublwik URL ñum mtrchechrabha yañkŕaalha mtawin tñur kwiimchu ha

source: Automatic private browsing. Browse. Erase. Repeat.
pai: Byaw´i Sal amchu. Sal m´am. Mtkryee. Mtkweek miyi.

source: Block 3rd-party cookies only
pai: Cookies jkayha paa t´tkyat

source: Block 3rd-party tracker cookies only
pai: T´am 3 nyumuk cookies uj nyaamch jmuuk jmuukum

source: Block ad trackers
pai: Chapayt kwaaw kwimchu ŕmewu mnmakum kjkeetem

source: Block analytic trackers
pai: Chapayt kŕmeechu chkk uu kajanu ha kos mnmakum kjkeetem

source: Block cookies
pai: Cookies tket

source: Block JavaScript
pai: JavaScript tket

source: Block other content trackers
pai: Chapyt kŕmeech paa t´t kyaata ñwak chapayt jkay ya

source: Block potentially dangerous and deceptive sites
pai: Waachu klyeeb´e paa wakyaw mŕ´am

source: Block reported deceptive and attack sites, malware sites, and unwanted software sites.
pai: Amchu chknarp ee paa jwakyaa ŕ ´amcha, amchu malware ee amchu software kos yaŕaalch tpaay mtket.

source: Block social trackers
pai: Paa waach chkŕmeech paa tketch

source: Block trackers
pai: Chkŕmeech paa tketch

source: Block Web fonts
pai: Tñur web wi tkat

source: Check that search string matches Example format
pai: Caden chŕmechu hay tñurchu sal kyakham nyamuha uuch

source: Clear
pai: Tkryee

source: Clear input
pai: Tñurchi tkyeech

source: Close Tab
pai: Tñur chiichu ŕ´aap

source: Content Blocking
pai: Mtbspachmwir amchu ñulyoom mchajanhikyawa

source: Cookies and Site Data
pai: Cookies e tñur wawchu

source: Copy image address
pai: Tñur uchú hal mtkweek mtñuri

source: Copy link address
pai: Tñur kwiimchu sak chpachu mtkweek mtñuri

source: Custom URLs
pai: URLs yemik trchechu wiijaan

source: Data Choices
pai: Tñurch t't orrum nyaamch

source: Data Collection & Use
pai: Tñur kabwik ñum tchech chu chyunk

source: Default
pai: Ñub ik chmiich

source: Default browser, tabs, language
pai: Sal amchu yooch, muul chmichu, kwaawchu

source: Default URL List
pai: URL mul te ñub ik chmiich

source: Developer tools
pai: Trechu sam nyaamch

source: Dismiss find in page
pai: Sal am chŕmeechu ŕ`amch

source: Double-check the URL you entered.
pai: URL sal mukjabha mtkweek m´uu.

source: Download
pai: Unaalch

source: Downloaded files <b>will not be deleted</b> when you erase %1$s history.
pai: Tñur unalch hay <b>kos pokchyutema</b> %1$s hal chkjkech ha.

source: Download File
pai: Tñur unal

source: Download Firefox
pai: Firefox munaal

source: Embedded on sites to track your visits and to display functionality like share buttons
pai: Wawchul wak sal ñmbaamum m´uu ñwak kabyuk trchech chuha tawinch paa wak ik

source: Enable to autocomplete more than 450 popular URLs in the address bar.
pai: Nmakchum 450 chayoomm chublwiich paa katee uchu URLs wachu tñurchuhal.

source: Enable to have %1$s autocomplete over 450 popular URLs in the address bar.
pai: Mchubowuka %1$s ey 450 URLs jaab trchech chu paa tek krab ñum ktrchech chayoomum chublwihikyawa.

source: Enabling may cause some pages to behave unexpectedly
pai: Ñumchubowum jabchu ñulyook kos janu bootem

source: Enter search engine name
pai: Motor sal amchu muul sal chmiich

source: Enter search string
pai: Caden chŕmechu ukjabch

source: Erase
pai: Ŕmar

source: Erase and Open
pai: Ŕmar e sol

source: Erase and open %1$s
pai: Ŕmar e sol %1$s

source: Erase browsing history
pai: Sal amchu mujiñ

source: Erase & open
pai: Ŕmar e sol

source: Example: example.com
pai: Yabwika: example.com

source: Example: example.com/search/?q=%s
pai: Yabwika: example.com/search/?q=%s

source: Example: mozilla.org
pai: Yabwika: mozilla.org

source: Exceptions
pai: Kos ñul´ebchtpaay

source: Exit Private Browsing?
pai: Sal amchu jabch tpaay al chpaa?

source: Find an app that can open link
pai: Aplicacion ŕit jabchu solum mŕmee

source: Find in page
pai: Chŕmeechu myook

source: Find in Page
pai: Chŕmeechu myook

source: Find next result
pai: Chapayt kjkech mib kyuw

source: Find previous result
pai: Chpayt kjkech jibo kjkech

source: Finger moved too fast. Try again.
pai: Ŕalhay wayiibulik ta ipeechu. Mtkeek mwiyik.

source: Fingerprint icon
pai: Icon ŕalchknaach digital

source: Fingerprint not recognized. Try again.
pai: Ŕal chkaam tawinchuhay kos uuch yutem. Mtkweek mwiyik.

source: For Sites You Add
pai: Wachuha sal chmiich

source: For Top sites
pai: Amchu kajan kajanu

source: General
pai: Payt

source: Get one-tap access to sites you use most%1$s Menu > Add to Home screen
pai: Wachu ñum mtrchechurabu hak mtawin ŕisum msol hikyaw myok %1$s jabchu wiham > Pantall namanchuhal chmiich

source: Get search suggestions
pai: Kabwik chŕmecuhu mukunabchu

source: Help
pai: Chbtaarch

source: Hide webpages when switching apps
pai: Jabchu web ha tjoot aplicación jkaay chkwa ñwam

source: Hide webpages when switching apps and block taking screenshots.
pai: Jab tñur ŕmeechu t`amch aplicacion ha jkaayum ñtyakum ñwak tñurchuha tketya.

source: Insecure Connection
pai: Tublich chu kos jaan tpaay

source: Installed search engines
pai: Motor chŕmechu ñuk chkwachumyok

source: Language
pai: Paa kwawchu

source: Loading
pai: Jukewu

source: Make %1$s default browser
pai: %1$s ha sal amchu jaan myoobka

source: Make privacy a habit
pai: Myeemik chmwiwuha myok majanuk

source: Manage sites
pai: Waachu ñumtrcheech

source: May result in missing icons or images
pai: Icon ee paa tñurch hal chapayt kamjwilchuhal aaw yome

source: More options
pai: Chwichu terab

source: More options button
pai: Tawiinchu chaterab kyaaw

source: Mozilla strives to collect only what we need to provide and improve %1$s for everyone.
pai: Mozilla hay chmwiwuha paytum chyunk ka %1$s paytum wichkyaaw chajaanrab hikyawa.

source: Navigate back
pai: Sal amchu tkweek jabch

source: Navigate forward
pai: Jiboom kyaamch

source: New custom URL added.
pai: URL jkaay yemi wii sal chmii.

source: New search engine added.
pai: Motor chŕmeechu jkaay kur sal chmiich.

source: New Session
pai: Namaan jkaay

source: New tab opened
pai: Yuŕumee jkaar sol

source: Next
pai: Nulkpeeb

source: No
pai: Pem

source: None of the apps on your device are able to open this link. You can leave %1$s to search %2$s for an app that can.
pai: Aplicacion dispositiiv mwi ŕitulik yak yoya soltema. %1$s myaam %2$s mŕmee aplicación ŕit kwa solhikyawa.

source: Notifications let you erase your %1$s session with a tap. You don’t need to open the app or see what’s running in your browser.
pai: Chknaabchuhay chynchu ha %1$s ah ŕmara tawinch ŕisum. Kos aplicación ha msol yaŕaaltem o sal amchuhay boo kwawu uch yutem.

source: Number of trackers blocked
pai: Chŕibchu chapayt ŕmeechuy ŕ´ap kyo

source: Off
pai: Ŕ'am

source: OK
pai: Jan ik yooch

source: OK, got it!
pai: ¡M´eb´e!

source: On
pai: Chubowu

source: Oops
pai: Ups

source: Open
pai: Sol

source: Open a link in a new tab Long-press any link on a page
pai: Sal chpach chu msol tñur chnichu jkaayl Jabchuha sal chpach chu yañkŕaalha mtawin

source: Open every link in %1$s Set %1$s as default browser
pai: Sal jabchu paytum yak myo %1$s Chyunku %1$s sal amchu kajan mika

source: Open in…
pai: Em msol…

source: Open in %1$s
pai: %1$s em msol

source: Open link in another app
pai: Jabchu aplicación jkayk solch

source: Open link in new tab
pai: Tñur chmichu jkaayk msol

source: Open with app
pai: Aplicación num msol

source: <p>%1$s puts you in control.</p> <p>Use it as a private browser: <ul> <li>Search and browse right in the app</li> <li>Block trackers (or update settings to allow trackers)</li> <li>Erase to delete cookies as well as search and browsing history</li> </ul> </p> <p>%1$s is produced by Mozilla. Our mission is to foster a healthy, open Internet.<br/> <a href="%2$s">Learn more</a></p>
pai: <p>%1$s hay kamwi ñumyabuyiib m´ee.</p><p>Sal amchu jabch tpay muliwu ñumtrcheech <ul> <li>Aplicación hal mjaab sal mtrchech</li> <li>Sal kchŕmeech paa mtket( o janmiwuham mnyam baam mchii)</li> <li>Mŕmar chapayt mujiñ hikyaaw cookies ee kur chkjkeech ee chŕmeech sal amchu</li> </ul></p><p>%1$s ha Mozilla hay uchpach. Chawiwchuha inernet krryeey paa ee hi kyawa.<br/><a href="%2$s">Chŕporaab</a></p>

source: Pages may load faster, but may also behave unexpectedly
pai: Jabchuhay wayiibrab jukewu yuso, kabyuu imyus kabyuwuha kos ŕpoochtema

source: Password
pai: Ŕ' amu

source: Paste or enter URL
pai: URL tublich sal chmii

source: Performance
pai: Kabyuk trchech chu

source: Powered by %1$s
pai: %1$s em ntpachu

source: Power up your privacy
pai: Myeemik chumwiwuha ta mwiluk

source: Privacy
pai: Jabchu tpaay

source: Privacy Notice
pai: Kabwik yemi wii jan yuwuha

source: Privacy & Security
pai: Jabchu tpaay ŕbokjanchu

source: Private browsing session
pai: Chyunch sal amchu ŕ´aap

source: Problem loading page
pai: Jachuyal jabch hay upar

source: Rather see the full desktop site?%1$s Menu > Request desktop site
pai: ¿Amchuha escritori wulim m´ukwal mi´e? %1$s Chŕmeechu > Amchu escritorihal k´kaab

source: Reload website
pai: Web tkweek jukewu

source: Remote debugging via USB/Wi-Fi
pai: Ñulyomuk tkryeechu USB/Wi-Fi nyaam

source: Remove
pai: Ujiñ

source: Remove all websites
pai: Amchu ha paytum ujiiñ

source: Remove custom URLs
pai: URLs yemi wiiha ujiiñ

source: Remove search engines
pai: Motor chŕmeechu ujiñ

source: Report Site Issue
pai: Wawchuha klyeebha paytum jwaknaabchu

source: Request desktop site
pai: Trchechu mk' kaab

source: Restart %1$s
pai: Tkweek namaan %1$s

source: Restore default search engines
pai: Motor chajaana januwa chŕmeech hay jan hikyawa

source: Return to previous app
pai: Aplicación jubo kyakhal tkweek

source: Return to your favorite sites in %1$s quickly. Just select "Add to Home screen" from the %1$s menu.
pai: Amchu jnmiraabhal %1$s hal khal koha wamyiibraw sal mtkweek. "Tñur kwimch namanchuhal mchmii" im myok %1$s chnamanchuhal.

source: Safe Browsing
pai: Chapayt mŕmee mnamaan

source: Save
pai: Chkwaach

source: Saved and shared images <b>will not be deleted</b> when you erase %1$s history.
pai: Tñur chkwach hay ee maat emch hay <b>kos ŕput tem a</b> %1$s kur rabb mtñur kjkeech ha kos poktema.

source: Save image
pai: Tñurch chgo

source: Search engine
pai: Chŕmeechu

source: Search engine name
pai: Motor chŕmechu muul

source: Search for %1$s
pai: %1$s chŕmee

source: Searching for something different? Choose another default search engine in Settings.
pai: ¿Ñukwee jkaayum yakum mŕmee´e? Chajanchu kur sal chmiich ha chubowu wiiha myok.

source: Search or enter address
pai: Tñur paa eemch ŕmee solch

source: Search Privately
pai: Jabchu tpaay chŕmee

source: Search string to use
pai: Caden ŕmee ñum trchech hi kyawa

source: Secure connection
pai: Tublich chu jan

source: Secure Connection
pai: Tublich chu jan

source: Secure connection failed
pai: Tublich chu kajanhay wupar

source: Security
pai: Kryek janu

source: Send crash report to Mozilla
pai: Wuñparum Mozilla kwiim

source: Send usage data
pai: Kamwiik daatha mwiruha m´emch

source: Server not found
pai: Paa kubtaar kos chyawtem

source: Set %1$s as your default browser and get the benefits of private browsing when you open webpages from other apps.
pai: %1$s ha sal amchu kajan mik mchmii pay sal amchu myeemik mwii ha kabuwu ha m´uk aplicación o tñur kwimch web hal amchu ha payrum m´uu.

source: Set default, autocomplete
pai: Bu januliwu chiich, yemik maat chulwiyu

source: Settings
pai: Chajaanch

source: Share…
pai: Mkwimu…

source: Share image
pai: Tñurch paa eem

source: Share link
pai: Jabchu paa maat eecha

source: Shortcut will open with Tracking Protection disabled
pai: Mir mir januk jabchuha ñsool ŕbok janchu ha kos bootem sola

source: Show home screen tips
pai: Pantallhak paa chknauwch sak chmiich

source: Site behaving unexpectedly? Try turning off Tracking Protection
pai: ¿Amchuhay chyuwu mŕbootemha wi`e? Kŕbo sam kwamha mujiñ m`uu

source: Site Security
pai: Amcchukajan

source: Skip
pai: Kos ñulm´ebtem

source: Some ads track site visits, even if you don’t click the ads
pai: Chapayt paa chu uubchu ñulyook sal m´amuhal chŕmeewu, may kos myootemkabyuso
